#файл с первым заданием
d1 = int(input('Введите кратчайшее расстояние от спасателя до кромки воды, d1 (ярды) => '))
d2 = int(input('Введите кратчайшее расстояние от утопающего до берега, d2 (ярды) => '))
h = int(input('Введите боковое смещение между спасателем и утопающим, h (ярды) => '))
v_sand = int(input('Введите скорость движения спасателя по песку, v_sand (мили в час) => '))
n = int(input('Введите коэффициент замедления спасателя при движении в воде, n => '))
theta1 = int(input('Введите направление движения спасателя по песку, theta1 (градусы) => '))